## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246706)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Delete
  * aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2 will be destroyed
  # (because aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2 is not in configuration)
  - resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-aws-otel-collector_9F54C4B2" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001" -> null
      - id                = "/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001" -> null
      - name_prefix       = "/ecs/ImageAPI-Prod/aws-otel-collector" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-imageapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ImageAPI"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-imageapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "ImageAPI"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:260" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                        {
                            name  = "REDIS_IS_CLUSTER"
                            value = "true"
                        },
                        # (3 unchanged elements hidden)
                    ]
                    name                   = "app"
                    # (11 unchanged attributes hidden)
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 260 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-imageapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ImageAPI"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:260" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"68df1585-d674-4c8f-9a34-28a96dc65472","JobName":"image-api_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"43abfa663c90642dd0745cde44ee02d4f29fd3f4","Target":"image-api-cdk","Vars":{}} -->